#+TITLE: Database tables
#+PROPERTY: header-args:sql :engine postgresql :dbhost 127.0.0.1 :dbuser clojure :dbpassword 123456 :database clojuredb
* Users
** Select all users
#+begin_src sql
SELECT * FROM users;
#+end_src

#+RESULTS:
| id | user_name | user_password | user_email | created_on | updated_on |
|----+-----------+---------------+------------+------------+------------|
** User roles
#+begin_src sql
SELECT r.role_name FROM user_roles AS ur LEFT JOIN roles AS r ON ur.role_id = r.id WHERE ur.user_id = 1;
#+end_src

#+RESULTS:
| role_name |
|-----------|
| guest     |

* Roles
** Select all roles
#+begin_src sql
SELECT * FROM roles;
#+end_src

#+RESULTS:
| id | role_name |
|----+-----------|
|  1 | admin     |
|  2 | moderator |
|  3 | guest     |
